import React from "react";

function App() {
  // const url =
  //   "https://ko.wikipedia.org/w/api.php?action=query&prop=extracts&titles=6%EC%9B%94%2027%EC%9D%BC&format=json&formatversion=2";
  // fetch(url)
  //   .then((response) => response.json())
  //   .then((data) => {
  //     console.log(data.query.pages[0].extract);
  //   });

  const data = `<p><span></span>
<b>6월 27일</b>은 그레고리력으로 178번째(윤년일 경우 179번째) 날에 해당한다.
</p>


<h2><span id=".EC.82.AC.EA.B1.B4"></span><span id="사건">사건</span></h2>
<ul><li>678년 - 교황 아가토, 79대 로마 교황으로 취임했다.</li>
<li>1743년 - 오스트리아 왕위 계승 전쟁 : 뎃팅겐 전투.</li>
<li>1759년 - 7년 전쟁 : 제임스 울프 이끄는 영국군이 누벨프랑스의 수도 퀘벡의 포위를 시작했다.</li>
<li>1862년 - 미국 남북전쟁, 반도전역 게인스 밀에서 남북군 전투. 북군 패배. 북군 철수 시작.</li>
<li>1917년 - 중립이었던 그리스가 전 동맹국에 선전 포고를 하다.</li>
<li>1950년 - 한국 전쟁 : 보도연맹 사건 . 유엔 안보리에서 조선민주주의인민공화국 탄핵 결의안이 통과된다.</li>
<li>1954년 - 변영태가 국무총리의 임기를 시작했다.</li>
<li>1974년 - 미국 대통령 리처드 닉슨이 소련을 방문.</li>
<li>1976년 - 텔아비브에서 파리행 에어 프랑스 항공기가 납치되어 우간다의 엔테베 국제공항에 강제 착륙되었다. 이후 7월 3일 이스라엘 특수부대가 기습침투하여 인질들을 구출하였는데 이것이 유명한 엔테베 작전이다.</li>
<li>1977년 - 지부티가 독립했다.</li>
<li>1980년 - 이탈리아 시칠리아 섬 근해에서 이타비아 항공 소속 항공기가 NATO의 미사일에 격추, 추락.</li>
<li>1991년 - 유고슬라비아 내전: 슬로베니아의 유고슬라비아에서 독립 선언을 통해 열흘간 전쟁이 발발.</li>
<li>1995년 - 대한민국에서 지방의회 의원 및 지방자치단체의 장을 선출하는 제1회 전국동시지방선거가 실시되다.</li>
<li>2007년 - 토니 블레어  영국 총리가 엘리자베스 2세에 사표를 제출했다.</li>
<li>2008년 - 북한 영변 냉각탑 폭파.</li>
<li>2013년 - 전두환 추징법이 반대 2표, 기권 4표로 국회 본회의에 통과하였다. 이로서 이 법은 2020년 10월까지 시효가 연장된다.</li>
<li>2014년 - 벨기에 브뤼셀에서 열린 EU 정상회의에서 장클로드 융커 전 룩셈부르크 총리를 유럽연합 집행위원장으로 지명하였다.</li></ul><h2><span id=".EB.AC.B8.ED.99.94"></span><span id="문화">문화</span></h2>
<ul><li>1967년 - 런던의 바클리스 은행(Barclays Bank)에 세계 최초의 ATM 설치.</li>
<li>1984년 - 88올림픽고속도로가 개통했다.</li>
<li>1990년 - 서울 지하철 5호선 착공.</li>
<li>1998년 - 말레이시아 쿠알라룸푸르 국제공항 개항.</li>
<li>2012년 - 대한민국의 스위치백 구간인 영동선 통리~심포리~흥전~나한정~도계 구간이 폐선되었다.</li>
<li>2013년 - 중부내륙고속도로 남여주 나들목 구간이 개통되었다.</li>
<li>2017년 - 롯데 자이언츠 가 역사적인 역전승 경기를 가져간 날이다.</li>
<li>2018년 - 2018년 러시아 월드컵에서 독일이 대한민국에 패함으로써 1938년 이후 80년만에 월드컵 본선 조별 예선에서 탈락하였다.</li></ul><h2><span id=".ED.83.84.EC.83.9D"></span><span id="탄생">탄생</span></h2>
<ul><li>1350년 - 동로마 제국의 황제 마누엘 2세 팔라이올로고스. (~1425년)</li>
<li>1462년 - 프랑스의 왕 루이 12세. (~1515년)</li>
<li>1550년 - 프랑스의 왕 샤를 9세. (~1574년)</li>
<li>1880년 - 미국의 작가, 장애인 복지활동가, 교육가, 사회주의자 헬렌 켈러. (~1968년)</li>
<li>1905년 - 중화권의 배우, 무술가 관더싱. (~1996년)</li>
<li>1914년 - 영국의 작가 로버트 에이크먼. (~1981년)</li>
<li>1919년 - 대한민국의 비전향장기수 신광수.</li>
<li>1932년 - 대한민국의 외교관 노재원. (~2006년)</li>
<li>1940년 - 미국의 수학자 대니얼 퀼런. (~2011년)</li>
<li>1941년
<ul><li>일본계 미국 정치인 마이크 혼다.</li>
<li>폴란드의 영화감독 크쥐시토프 키에슬로프스키. (~1996년)</li></ul></li>
<li>1952년
<ul><li>대한민국의 가수 이용복.</li>
<li>프랑스의 가수 다니엘 비달.</li></ul></li>
<li>1953년 - 일본의 애니메이션 미술감독 야마모토 니조. (~2023년)</li>
<li>1955년 - 프랑스의 영화배우 이자벨 아자니.</li>
<li>1962년 - 중국의 배우 량차오웨이(양조위).</li>
<li>1964년 - 대한민국의 배우 박준규.</li>
<li>1965년 - 대한민국의 방송인, 언론인 신동욱.</li>
<li>1966년
<ul><li>미국의 영화감독 J. J. 에이브럼스.</li>
<li>대한민국의 전 축구 선수, 현 축구 코치 고정운.</li>
<li>대한민국의 배우 김보성.</li></ul></li>
<li>1975년 - 미국의 배우 토비 매과이어.</li>
<li>1977년 - 스페인의 축구 선수 라울 곤살레스.</li>
<li>1979년
<ul><li>대한민국의 배우 김규리.</li>
<li>대한민국의 전 야구 선수 조현수.</li></ul></li>
<li>1980년
<ul><li>대한민국의 희극인 노우진.</li>
<li>대한민국의 야구 선수 정성훈.</li></ul></li>
<li>1982년 - 조선민주주의인민공화국의 축구 선수 리한재.</li>
<li>1984년 - 대한민국의 배우 손호준.</li>
<li>1986년
<ul><li>대한민국의 야구 선수 배영섭.</li>
<li>미국의 가수, 배우, 코미디언, 작가 드레이크 벨.</li></ul></li>
<li>1987년 - 대한민국의 컬링 선수 김지선.</li>
<li>1988년 - 독일의 축구 선수 첼리아 샤시치.</li>
<li>1989년 - 대한민국의 레이싱 모델 강하빈.</li>
<li>1990년 - 대한민국의 레이싱 모델 이아린.</li>
<li>1991년
<ul><li>대한민국의 배우 이원근.</li>
<li>대한민국의 전 가수 박민하.(나인뮤지스)</li></ul></li>
<li>1992년
<ul><li>대한민국의 가수, 영화배우 안소희.</li>
<li>일본의 배우, 패션 모델 혼다 츠바사.</li></ul></li>
<li>1993년 - 대한민국의 가수 러비.</li>
<li>1994년 - 대한민국의 가수 서영.(헬로비너스)</li>
<li>1995년 - 대한민국의 야구 선수 조이현.</li>
<li>1996년 - 대한민국의 치어리더 손지해.</li>
<li>1997년
<ul><li>대한민국의 야구 선수 박세진.</li>
<li>대한민국의 유도 선수 이하림.</li></ul></li>
<li>1998년 - 대한민국의 가수 건희.</li></ul><h2><span id=".EC.82.AC.EB.A7.9D"></span><span id="사망">사망</span></h2>
<ul><li>1458년 - 아라곤의 왕 알폰소 5세. (1396년~)</li>
<li>1574년 - 이탈리아의 화가이자 건축가 조르지오 바사리. (1511년~)</li>
<li>1636년 - 일본 센고쿠 시대 장수 다테 마사무네. (1567년~)</li>
<li>1831년 - 프랑스의 수학자 소피 제르맹. (1776년~)</li>
<li>1985년 - 대한민국의 정치인 권중돈. (1912년~)</li>
<li>1999년 - 그리스의 독재자 요르요스 파파도풀로스. (1919년~)</li>
<li>2001년 - 핀란드의 화가, 소설가 토베 얀손. (1914년~)</li>
<li>2005년 - 대한민국의 가수 김창남. (1957년~)</li>
<li>2007년 - 대한민국의 인터넷 작가 이동훈. (1980년~)</li>
<li>2016년 - 대한민국의 쇼트트랙선수 오세종. (1982년~)</li>
<li>2016년 - 미국의 미래학자 앨빈 토플러. (1928년~)</li>
<li>2017년 - 대한민국의 마라톤선수 서윤복. (1923년~)</li>
<li>2017년 - 스웨덴의 배우 미카엘 뉘크비스트. (1960년~)</li>
<li>2018년 - 대한민국의 정치인 최돈웅. (1935년~)</li>
<li>2018년 - 미국의 가수 조지프 잭슨. (1928년~)</li>
<li>2018년 - 미국의 소설가 할런 엘리슨. (1934년~)</li>
<li>2020년 - 세르비아의 축구감독 일리야 페트코비치. (1945년~)</li>
<li>2020년 - 아르헨티나의 영화배우 린다 크리스털. (1934년~)</li>
<li>2020년 - 미국의 기업인 잭 휘태커. (1947년~)</li>
<li>2022년 - 미국의 영화배우 조 터켈. (1927년~)</li>
<li>2023년 - 스위스의 작가 파스칼 메르시어. (1944년~)</li>
<li>2023년 - 대한민국의 정치인 윤석민. (1938년~)</li></ul><h2><span id=".EA.B8.B0.EB.85.90.EC.9D.BC"></span><span id="기념일">기념일</span></h2>
<ul><li>독립기념일: 지부티</li>
<li>헬렌켈러의 날: 미국</li>
<li>국립 HIV 테스트의 날(NHTD): 미국</li>
<li>혼혈인의 날: 브라질</li>
<li>캐나다 다문화의 날(Canadian Multiculturalism Day): 캐나다</li>
<li>국군의 날(formerly Veterans' Day): 영국</li>
<li>국민 화합의 날: 타지키스탄</li></ul><h2><span id=".EA.B0.99.EC.9D.B4_.EB.B3.B4.EA.B8.B0"></span><span id="같이_보기">같이 보기</span></h2>
<ul><li>전날: 6월 26일 다음날: 6월 28일 - 전달: 5월 27일 다음달: 7월 27일</li>
<li>음력: 6월 27일</li>
<li>모두 보기</li></ul>`;

  return <div>home</div>;
}

export default App;
